# GroupBy Reshaping Pivot Table

### Groupby

In [39]:
import pandas as pd

In [40]:
data = {
    'Employee': ['John', 'Anna', 'Peter', 'Linda', 'James', 'Laura', 'Michael'],
    'Department': ['HR', 'IT', 'IT', 'HR', 'IT', 'HR', 'Finance'],
    'Salary': [60000, 75000, 80000, 62000, 70000, 59000, 85000],
    'Experience': [5, 8, 6, 7, 4, 3, 10]
}

In [41]:
df=pd.DataFrame(data)

In [42]:
df

  Employee Department  Salary  Experience
0     John         HR   60000           5
1     Anna         IT   75000           8
2    Peter         IT   80000           6
3    Linda         HR   62000           7
4    James         IT   70000           4
5    Laura         HR   59000           3
6  Michael    Finance   85000          10

In [43]:
# Group by Department and aggregate using mean and max
agg = df.groupby('Department').agg(
    avg_salary=('Salary', 'mean'),
    max_salary=('Salary', 'max'),
    avg_experience=('Experience', 'mean')
)

In [44]:
agg

              avg_salary  max_salary  avg_experience
Department
Finance     85000.000000       85000            10.0
HR          60333.333333       62000             5.0
IT          75000.000000       80000             6.0

In [45]:
# Filtering groups where average salary > 70000
filtered = agg[agg['avg_salary'] > 70000]

In [46]:
filtered

            avg_salary  max_salary  avg_experience
Department
Finance        85000.0       85000            10.0
IT             75000.0       80000             6.0

In [73]:
# Group by Department and apply a custom function to calculate Salary Increase
# df['IncreasedSalary'] = df.groupby('Department', group_keys=False).apply(
#     salary_increase, include_groups=False
# )

In [75]:
df

  Employee Department  Salary  Experience
0     John         HR   60000           5
1     Anna         IT   75000           8
2    Peter         IT   80000           6
3    Linda         HR   62000           7
4    James         IT   70000           4
5    Laura         HR   59000           3
6  Michael    Finance   85000          10

### Reshaping Melt & Stack

In [78]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [90, 85, 80],
    'Science': [88, 92, 85],
    'English': [95, 85, 89]
}

In [80]:
df=pd.DataFrame(data)

In [82]:
df

      Name  Math  Science  English
0    Alice    90       88       95
1      Bob    85       92       85
2  Charlie    80       85       89

In [84]:
#melting data
#Let’s convert this wide-form data (where subjects are columns) into long-form data (where subjects become values).

In [86]:
# Melting the data to long form
melted = df.melt(id_vars='Name', var_name='Subject', value_name='Grade')

In [88]:
melted

      Name  Subject  Grade
0    Alice     Math     90
1      Bob     Math     85
2  Charlie     Math     80
3    Alice  Science     88
4      Bob  Science     92
5  Charlie  Science     85
6    Alice  English     95
7      Bob  English     85
8  Charlie  English     89

In [90]:
#Stacking Data:
#Stacking converts columns into rows. It is another way of transforming data, especially for multi-level indices.

In [92]:
# Stacking the data (pivoting columns into rows)
stacked = df.set_index('Name').stack()

In [94]:
stacked

Name
Alice    Math       90
         Science    88
         English    95
Bob      Math       85
         Science    92
         English    85
Charlie  Math       80
         Science    85
         English    89
dtype: int64

In [96]:
#unstacking data

In [98]:
#unstack is the reverse of stack. It will pivot rows back to columns.

In [100]:
# Unstacking the data
unstacked = stacked.unstack()

In [102]:
unstacked

         Math  Science  English
Name
Alice      90       88       95
Bob        85       92       85
Charlie    80       85       89

### Pivot tables

In [105]:
#Pivot tables allow for more complex aggregation and summarization.

In [107]:
# Sales Data with Multiple Aggregations
#Let’s use a more complex pivot table that calculates both the total and average revenue per product and per city.

In [109]:
data = {
    'OrderID': [1, 2, 3, 4, 5, 6],
    'Product': ['Shoes', 'Shoes', 'Shirt', 'Shirt', 'Shirt', 'Shoes'],
    'Category': ['Footwear', 'Footwear', 'Apparel', 'Apparel', 'Apparel', 'Footwear'],
    'Quantity': [2, 3, 1, 5, 2, 4],
    'Price': [50, 50, 30, 30, 30, 50],
    'City': ['New York', 'Los Angeles', 'New York', 'New York', 'Los Angeles', 'New York']
}

In [111]:
df=pd.DataFrame(data)

In [113]:
df

   OrderID Product  Category  Quantity  Price         City
0        1   Shoes  Footwear         2     50     New York
1        2   Shoes  Footwear         3     50  Los Angeles
2        3   Shirt   Apparel         1     30     New York
3        4   Shirt   Apparel         5     30     New York
4        5   Shirt   Apparel         2     30  Los Angeles
5        6   Shoes  Footwear         4     50     New York

In [115]:
## Adding TotalRevenue column

In [117]:
df['TotalRevenue'] = df['Quantity'] * df['Price']

In [119]:
# Pivot table with multiple aggregation functions
pivot_table = df.pivot_table(index='City', columns='Product', values='TotalRevenue',
                             aggfunc={'TotalRevenue': ['sum', 'mean']})

In [121]:
pivot_table

             mean          sum
Product     Shirt  Shoes Shirt Shoes
City
Los Angeles  60.0  150.0    60   150
New York     90.0  150.0   180   300

In [ ]:
#Margins in Pivot Tables:

In [ ]:
#You can add margins to include the totals across the entire dataset.

In [ ]:
# Adding a Total (margins) to the pivot table
pivot_table_with_totals = df.pivot_table(index='City', columns='Product', values='TotalRevenue',
                                         aggfunc='sum', margins=True)

In [ ]:
pivot_table_with_totals

### Handling Missing Data in Groupby , pivot and reshaping

In [ ]:
data_with_nan = {
    'OrderID': [1, 2, 3, 4, 5, 6],
    'Product': ['Shoes', 'Shoes', 'Shirt', 'Shirt', 'Shirt', 'Shoes'],
    'Category': ['Footwear', 'Footwear', 'Apparel', 'Apparel', 'Apparel', 'Footwear'],
    'Quantity': [2, 3, None, 5, 2, None],
    'Price': [50, 50, 30, 30, None, 50],
    'City': ['New York', 'Los Angeles', 'New York', 'New York', 'Los Angeles', 'New York']
}

In [ ]:
df_nan=pd.DataFrame(data_with_nan)

In [ ]:
# Handling missing values in groupby
grouped_with_nan = df_nan.groupby('City')['Price'].mean()  # Automatically skips NaN

In [ ]:
grouped_with_nan